public/blog/syncthing.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-03-20 Sun 20:58 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Syncthing</title>
<meta name="author" content="Toby Law" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="res/tufte.min.css" />
</head>
<body>
<article id="content" class="content">
<header>
<h1 class="title">Syncthing</h1>
</header><p>
<a href="../blog.html">← Back to blog</a>
</p>

<p>
Last modified: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-20 Sun&gt;</span></span>
</p>

<section id="outline-2" class="nil">
<h2 id="other-file-sync-solutions">Other file sync solutions</h2>
<p>
I&rsquo;ve been using file storage and synchronisation services for almost 10 years. What started as a simple way of backing up my personal files has become a critical part of my work flow as I often have to jump between different devices. Over that time, I&rsquo;ve tried the likes of Dropbox, Google Drive, and most recently, MEGAsync, but I haven&rsquo;t been completely satisfied with them.
</p>
<ul class="org-ul">
<li>Dropbox: Only starts you with 2 GB (up to 16 GB if you complete all the tasks and refer other people), which just isn&rsquo;t enough for how I work (I like storing a bunch of reference material). Overall though, I enjoyed the user experience of Dropbox the most and think it&rsquo;s maybe the most suitable for less technical users.</li>
<li>Google Drive: Similar to Dropbox, the free plan only gives you 15 GB of space and that&rsquo;s shared across all of your Google services. Additionally, I had a lot of trouble getting Google Drive to work on Linux properly &#x2013; despite Google saying an official client was in the works for years, nothing ever came out. There are third party clients you can use, but I would relatively frequently run into sync issues that were a headache to debug and fix.</li>
<li>MEGAsync: Finally I came across something that seemed like my long-term solution. MEGAsync offers 50 GB of storage on its free tier and is cross-platform; I was able to get it running on Windows/MacOS/Linux without too much trouble. It also has mobile apps and a web client which have been great for transferring files between my computer and my phone and The main issue I&rsquo;m having with it now is that on my MacBook, it won&rsquo;t automatically detect changes and I frequently have to restart the client to force a sync.</li>
</ul>

<p>
In summary, what I really want is a file sync service that is
</p>
<ol class="org-ol">
<li>Free</li>
<li>Able to handle 10-20 GB of files</li>
<li>Cross-platform</li>
<li>Reliable, in that I don&rsquo;t have to spend time working out why my files are out of sync</li>
</ol>
</section>

<section id="outline-2" class="nil">
<h2 id="why-syncthing?">Why Syncthing?</h2>
<p>
I stumbled across <a href="https://tonsky.me/blog/syncthing/">Computers as I used to love them</a> and Syncthing seemed like the natural next step for me. I love that its free and open-source, and that it doesn&rsquo;t rely on some central server storing all of your files. It removes the artificial limitation of having to pay for storage space &#x2013; now I can sync as much as can fit on my hard-drive. Additionally, you can sync any folder on your hard-drive, it doesn&rsquo;t have to be contained within some central sync folder.
</p>

<p>
The only downside is that there is no iOS app yet, but I don&rsquo;t really browse my files from my phone. A more common use case for me is transferring files and I&rsquo;m still on the lookout for an appropriate tool.
</p>
</section>

<section id="outline-2" class="nil">
<h2 id="installing-on-macbook">Installing on MacBook</h2>
<p>
Setting up Syncthing was super simple. To get set up, all you need to do is download a binary from the <a href="https://github.com/syncthing/syncthing/releases">project releases page</a> and run it. In my case, I just used Homebrew:
</p>
<pre class="code"><code>brew install syncthing
brew services start syncthing
</code></pre>

<p>
By default, Syncthing runs on <code>localhost:8384</code>. To avoid Syncthing opening the browser UI when it starts, you need to uncheck Start Browser under Actions &gt; Settings &gt; GUI.
</p>
</section>

<section id="outline-2" class="nil">
<h2 id="installing-on-windows-(wsl)">Installing on Windows (WSL)</h2>
<p>
To install Syncthing on Ubuntu (the OS I&rsquo;m using for WSL), it&rsquo;s as simple as
</p>
<pre class="code"><code><span style="color: #727072;"># </span><span style="color: #727072;">Add the release PGP keys:</span>
<span style="color: #78DCE8;">sudo</span> <span style="color: #78DCE8;">curl</span> -s -o /usr/share/keyrings/syncthing-archive-keyring.gpg https://syncthing.net/release-key.gpg#+end_src
<span style="color: #727072;"># </span><span style="color: #727072;">Add the "stable" channel to your APT sources:</span>
<span style="color: #78DCE8;">echo</span> <span style="color: #FFD866;">"deb [signed-by=/usr/share/keyrings/syncthing-archive-keyring.gpg] https://apt.syncthing.net/ syncthing stable"</span> | <span style="color: #78DCE8;">sudo</span> tee /etc/apt/sources.list.d/syncthing.list
<span style="color: #727072;"># </span><span style="color: #727072;">Update and install syncthing:</span>
<span style="color: #78DCE8;">sudo</span> apt-get update
<span style="color: #78DCE8;">sudo</span> apt-get install syncthing
</code></pre>

<p>
The version of Syncthing available by default with Ubuntu is old and doesn&rsquo;t run properly so it&rsquo;s important to add either the &ldquo;candidate&rdquo; or &ldquo;stable&rdquo; channel.
</p>

<p>
Getting Syncthing to automatically startup is not as easy as it is on MacOS. It turns out that systemd is not fully operational on WSL: &ldquo;As of Nov 2021, Canonical is working on bring systemd to WSL.&rdquo; Instead, my approach was to add the following snippet to my <code>.zprofile</code>:
</p>
<pre class="code"><code><span style="color: #727072;"># </span><span style="color: #727072;">Start Syncthing</span>
<span style="color: #FF6188;">if</span> <span style="color: #FF6188; font-weight: bold;">!</span> /usr/bin/pgrep syncthing &gt; /dev/null; <span style="color: #FF6188;">then</span>
    <span style="color: #AB9DF2;">(</span>nohup syncthing &gt; /dev/null <span style="color: #AB9DF2; font-weight: bold;">2</span>&gt;&amp;<span style="color: #AB9DF2; font-weight: bold;">1</span> &amp;<span style="color: #AB9DF2;">)</span>
<span style="color: #FF6188;">fi</span>
</code></pre>
</section>

<section id="outline-2" class="nil">
<h2 id="sharing-a-folder-between-devices">Sharing a folder between devices</h2>
<p>
I&rsquo;ve added my MacBook Air to my Windows desktop machine. Then sharing a folder was as easy as clicking edit and selecting the device to share with.
</p>

<p>
So far, I&rsquo;ve only shared my org files, but they&rsquo;re by far the files I edit the most.
</p>
</section>
</article>
</body>
</html>
